Revit 2026 API

# DocumentGetWorksetId Method

---

Get Id of the Workset which owns the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetId GetWorksetId(
	ElementId id
)
```
```vb
Public Function GetWorksetId (
	id As ElementId
) As WorksetId
```
```cpp
public:
WorksetId^ GetWorksetId(
	ElementId^ id
)
```
```fsharp
member GetWorksetId :
        id : ElementId -> WorksetId
```

#### Parameters

id ElementId
     Id of the element.

#### Return Value

WorksetId Id of the Workset which owns the element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Each element belongs to one and only one workset.

#### Reference

Document Class

Autodesk.Revit.DB Namespace